# Hiding specific rows

In [1]:
import pandas as pd

In [2]:
data = {
    'ID': [1, 2, 3],
    'Name': ['Alice', 'Bob', 'Carol'],
    'Math': [85, 92, 78],
    'Science': [90, 88, 82]
}
df = pd.DataFrame(data)
df

   ID   Name  Math  Science
0   1  Alice    85       90
1   2    Bob    92       88
2   3  Carol    78       82

In [4]:
styled_df = df.style
styled_df.hide([2])
styled_df

# hide_index

In [5]:
df

   ID   Name  Math  Science
0   1  Alice    85       90
1   2    Bob    92       88
2   3  Carol    78       82

In [6]:
print(df.to_string(index=False))

 ID  Name  Math  Science
  1 Alice    85       90
  2   Bob    92       88
  3 Carol    78       82